Jax-ws-Clients/BareClient/web-service-client/logs/app.log

2022-10-17 15:58:56.340 INFO main ge.ufc.webservices.handler.SoapHandler  methodName=handleMessage {{{ SOAP request sent: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <ns2:GetPersonRequest xmlns:ns2="http://ws.webapps.ufc.ge/">
      <id>1</id>
      <auth>
        <username>admin</username>
        <password>password</password>
      </auth>
    </ns2:GetPersonRequest>
  </S:Body>
</S:Envelope>
 }}} 
2022-10-17 15:58:56.889 INFO main ge.ufc.webservices.handler.SoapHandler  methodName=handleMessage {{{ SOAP response received: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <ns2:GetPersonResult xmlns:ns2="http://ws.webapps.ufc.ge/">
      <person id="1">
        <first-name>Giorgi</first-name>
        <last-name>Katsadze</last-name>
        <age>33</age>
      </person>
    </ns2:GetPersonResult>
  </S:Body>
</S:Envelope>
 }}} 
2022-10-17 15:58:56.940 INFO main ge.ufc.webservices.handler.SoapHandler  methodName=handleMessage {{{ SOAP request sent: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <ns2:UpdatePersonRequest xmlns:ns2="http://ws.webapps.ufc.ge/">
      <id>6</id>
      <first-name>Giorgi</first-name>
      <last-name>G</last-name>
      <age>35</age>
      <auth>
        <username>admin</username>
        <password>password</password>
      </auth>
    </ns2:UpdatePersonRequest>
  </S:Body>
</S:Envelope>
 }}} 
2022-10-17 15:58:56.989 INFO main ge.ufc.webservices.handler.SoapHandler  methodName=handleMessage {{{ SOAP response received: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <ns2:UpdatePersonResult xmlns:ns2="http://ws.webapps.ufc.ge/">
      <Updated>true</Updated>
    </ns2:UpdatePersonResult>
  </S:Body>
</S:Envelope>
 }}} 
2022-10-17 15:58:57.009 INFO main ge.ufc.webservices.handler.SoapHandler  methodName=handleMessage {{{ SOAP request sent: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <ns2:AddPersonRequest xmlns:ns2="http://ws.webapps.ufc.ge/" id="7">
      <first-name>new Person</first-name>
      <last-name>added</last-name>
      <age>10</age>
      <auth>
        <username>admin</username>
        <password>password</password>
      </auth>
    </ns2:AddPersonRequest>
  </S:Body>
</S:Envelope>
 }}} 
2022-10-17 15:58:57.057 INFO main ge.ufc.webservices.handler.SoapHandler  methodName=handleMessage {{{ SOAP response received: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <ns2:addPersonResult xmlns:ns2="http://ws.webapps.ufc.ge/">
      <Added>true</Added>
    </ns2:addPersonResult>
  </S:Body>
</S:Envelope>
 }}} 
2022-10-17 15:58:57.080 INFO main ge.ufc.webservices.handler.SoapHandler  methodName=handleMessage {{{ SOAP request sent: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <ns2:ListPersonRequest xmlns:ns2="http://ws.webapps.ufc.ge/">
      <auth>
        <username>admin</username>
        <password>password</password>
      </auth>
    </ns2:ListPersonRequest>
  </S:Body>
</S:Envelope>
 }}} 
2022-10-17 15:58:57.140 INFO main ge.ufc.webservices.handler.SoapHandler  methodName=handleMessage {{{ SOAP response received: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <ns2:ListPerson xmlns:ns2="http://ws.webapps.ufc.ge/">
      <person id="1">
        <first-name>Giorgi</first-name>
        <last-name>Katsadze</last-name>
        <age>33</age>
      </person>
      <person id="2">
        <first-name>Luka</first-name>
        <last-name>Nemsiwveridze</last-name>
        <age>19</age>
      </person>
      <person id="3">
        <first-name>Cristiano</first-name>
        <last-name>Ronaldo</last-name>
        <age>37</age>
      </person>
      <person id="4">
        <first-name>Lionel</first-name>
        <last-name>Messi</last-name>
        <age>35</age>
      </person>
      <person id="5">
        <first-name>Guram</first-name>
        <last-name>Kashia</last-name>
        <age>35</age>
      </person>
      <person id="6">
        <first-name>Giorgi</first-name>
        <last-name>G</last-name>
        <age>35</age>
      </person>
      <person id="7">
        <first-name>new Person</first-name>
        <last-name>added</last-name>
        <age>10</age>
      </person>
    </ns2:ListPerson>
  </S:Body>
</S:Envelope>
 }}} 
2022-10-17 15:58:57.160 INFO main ge.ufc.webservices.handler.SoapHandler  methodName=handleMessage {{{ SOAP request sent: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <ns2:DeletePersonRequest xmlns:ns2="http://ws.webapps.ufc.ge/">
      <id>7</id>
      <auth>
        <username>admin</username>
        <password>password</password>
      </auth>
    </ns2:DeletePersonRequest>
  </S:Body>
</S:Envelope>
 }}} 
2022-10-17 15:58:57.205 INFO main ge.ufc.webservices.handler.SoapHandler  methodName=handleMessage {{{ SOAP response received: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <ns2:DeletePersonResult xmlns:ns2="http://ws.webapps.ufc.ge/">
      <Deleted>true</Deleted>
    </ns2:DeletePersonResult>
  </S:Body>
</S:Envelope>
 }}} 
2022-10-17 15:58:57.220 INFO main ge.ufc.webservices.handler.SoapHandler  methodName=handleMessage {{{ SOAP request sent: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <ns2:ListPersonRequest xmlns:ns2="http://ws.webapps.ufc.ge/">
      <auth>
        <username>admin</username>
        <password>password</password>
      </auth>
    </ns2:ListPersonRequest>
  </S:Body>
</S:Envelope>
 }}} 
2022-10-17 15:58:57.260 INFO main ge.ufc.webservices.handler.SoapHandler  methodName=handleMessage {{{ SOAP response received: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <ns2:ListPerson xmlns:ns2="http://ws.webapps.ufc.ge/">
      <person id="1">
        <first-name>Giorgi</first-name>
        <last-name>Katsadze</last-name>
        <age>33</age>
      </person>
      <person id="2">
        <first-name>Luka</first-name>
        <last-name>Nemsiwveridze</last-name>
        <age>19</age>
      </person>
      <person id="3">
        <first-name>Cristiano</first-name>
        <last-name>Ronaldo</last-name>
        <age>37</age>
      </person>
      <person id="4">
        <first-name>Lionel</first-name>
        <last-name>Messi</last-name>
        <age>35</age>
      </person>
      <person id="5">
        <first-name>Guram</first-name>
        <last-name>Kashia</last-name>
        <age>35</age>
      </person>
      <person id="6">
        <first-name>Giorgi</first-name>
        <last-name>G</last-name>
        <age>35</age>
      </person>
    </ns2:ListPerson>
  </S:Body>
</S:Envelope>
 }}} 
2022-10-17 16:03:13.771 INFO main ge.ufc.webservices.handler.SoapHandler  methodName=handleMessage {{{ SOAP request sent: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <ns2:GetPersonRequest xmlns:ns2="http://ws.webapps.ufc.ge/">
      <id>1</id>
      <auth>
        <username>admin</username>
        <password>password</password>
      </auth>
    </ns2:GetPersonRequest>
  </S:Body>
</S:Envelope>
 }}} 
2022-10-17 16:03:14.306 INFO main ge.ufc.webservices.handler.SoapHandler  methodName=handleMessage {{{ SOAP response received: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <ns2:GetPersonResult xmlns:ns2="http://ws.webapps.ufc.ge/">
      <person id="1">
        <first-name>Giorgi</first-name>
        <last-name>Katsadze</last-name>
        <age>33</age>
      </person>
    </ns2:GetPersonResult>
  </S:Body>
</S:Envelope>
 }}} 
2022-10-17 16:03:14.351 INFO main ge.ufc.webservices.handler.SoapHandler  methodName=handleMessage {{{ SOAP request sent: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <ns2:UpdatePersonRequest xmlns:ns2="http://ws.webapps.ufc.ge/">
      <id>6</id>
      <first-name>Giorgi</first-name>
      <last-name>G</last-name>
      <age>35</age>
      <auth>
        <username>admin</username>
        <password>password</password>
      </auth>
    </ns2:UpdatePersonRequest>
  </S:Body>
</S:Envelope>
 }}} 
2022-10-17 16:03:14.400 INFO main ge.ufc.webservices.handler.SoapHandler  methodName=handleMessage {{{ SOAP response received: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <ns2:UpdatePersonResult xmlns:ns2="http://ws.webapps.ufc.ge/">
      <Updated>true</Updated>
    </ns2:UpdatePersonResult>
  </S:Body>
</S:Envelope>
 }}} 
2022-10-17 16:03:14.416 INFO main ge.ufc.webservices.handler.SoapHandler  methodName=handleMessage {{{ SOAP request sent: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <ns2:AddPersonRequest xmlns:ns2="http://ws.webapps.ufc.ge/" id="7">
      <first-name>new Person</first-name>
      <last-name>added</last-name>
      <age>10</age>
      <auth>
        <username>admin</username>
        <password>password</password>
      </auth>
    </ns2:AddPersonRequest>
  </S:Body>
</S:Envelope>
 }}} 
2022-10-17 16:03:14.461 INFO main ge.ufc.webservices.handler.SoapHandler  methodName=handleMessage {{{ SOAP response received: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <ns2:addPersonResult xmlns:ns2="http://ws.webapps.ufc.ge/">
      <Added>true</Added>
    </ns2:addPersonResult>
  </S:Body>
</S:Envelope>
 }}} 
2022-10-17 16:03:14.471 INFO main ge.ufc.webservices.handler.SoapHandler  methodName=handleMessage {{{ SOAP request sent: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <ns2:ListPersonRequest xmlns:ns2="http://ws.webapps.ufc.ge/">
      <auth>
        <username>admin</username>
        <password>password</password>
      </auth>
    </ns2:ListPersonRequest>
  </S:Body>
</S:Envelope>
 }}} 
2022-10-17 16:03:14.531 INFO main ge.ufc.webservices.handler.SoapHandler  methodName=handleMessage {{{ SOAP response received: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <ns2:ListPerson xmlns:ns2="http://ws.webapps.ufc.ge/">
      <person id="1">
        <first-name>Giorgi</first-name>
        <last-name>Katsadze</last-name>
        <age>33</age>
      </person>
      <person id="2">
        <first-name>Luka</first-name>
        <last-name>Nemsiwveridze</last-name>
        <age>19</age>
      </person>
      <person id="3">
        <first-name>Cristiano</first-name>
        <last-name>Ronaldo</last-name>
        <age>37</age>
      </person>
      <person id="4">
        <first-name>Lionel</first-name>
        <last-name>Messi</last-name>
        <age>35</age>
      </person>
      <person id="5">
        <first-name>Guram</first-name>
        <last-name>Kashia</last-name>
        <age>35</age>
      </person>
      <person id="6">
        <first-name>Giorgi</first-name>
        <last-name>G</last-name>
        <age>35</age>
      </person>
      <person id="7">
        <first-name>new Person</first-name>
        <last-name>added</last-name>
        <age>10</age>
      </person>
    </ns2:ListPerson>
  </S:Body>
</S:Envelope>
 }}} 
2022-10-17 16:03:14.546 INFO main ge.ufc.webservices.handler.SoapHandler  methodName=handleMessage {{{ SOAP request sent: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <ns2:DeletePersonRequest xmlns:ns2="http://ws.webapps.ufc.ge/">
      <id>7</id>
      <auth>
        <username>admin</username>
        <password>password</password>
      </auth>
    </ns2:DeletePersonRequest>
  </S:Body>
</S:Envelope>
 }}} 
2022-10-17 16:03:14.601 INFO main ge.ufc.webservices.handler.SoapHandler  methodName=handleMessage {{{ SOAP response received: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <ns2:DeletePersonResult xmlns:ns2="http://ws.webapps.ufc.ge/">
      <Deleted>true</Deleted>
    </ns2:DeletePersonResult>
  </S:Body>
</S:Envelope>
 }}} 
2022-10-17 16:03:14.610 INFO main ge.ufc.webservices.handler.SoapHandler  methodName=handleMessage {{{ SOAP request sent: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <ns2:ListPersonRequest xmlns:ns2="http://ws.webapps.ufc.ge/">
      <auth>
        <username>admin</username>
        <password>password</password>
      </auth>
    </ns2:ListPersonRequest>
  </S:Body>
</S:Envelope>
 }}} 
2022-10-17 16:03:14.656 INFO main ge.ufc.webservices.handler.SoapHandler  methodName=handleMessage {{{ SOAP response received: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <ns2:ListPerson xmlns:ns2="http://ws.webapps.ufc.ge/">
      <person id="1">
        <first-name>Giorgi</first-name>
        <last-name>Katsadze</last-name>
        <age>33</age>
      </person>
      <person id="2">
        <first-name>Luka</first-name>
        <last-name>Nemsiwveridze</last-name>
        <age>19</age>
      </person>
      <person id="3">
        <first-name>Cristiano</first-name>
        <last-name>Ronaldo</last-name>
        <age>37</age>
      </person>
      <person id="4">
        <first-name>Lionel</first-name>
        <last-name>Messi</last-name>
        <age>35</age>
      </person>
      <person id="5">
        <first-name>Guram</first-name>
        <last-name>Kashia</last-name>
        <age>35</age>
      </person>
      <person id="6">
        <first-name>Giorgi</first-name>
        <last-name>G</last-name>
        <age>35</age>
      </person>
    </ns2:ListPerson>
  </S:Body>
</S:Envelope>
 }}} 
